<a href="https://colab.research.google.com/github/PomesHouse/SkillTreePython-DataAnalysis/blob/main/01.%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D%EA%B8%B0%EC%B4%88/09_%EC%A0%84%EC%B2%98%EB%A6%AC%EC%8B%A4%EC%8A%B5_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Ch09. 전처리 실습 - Titanic
---
* 날짜:
* 이름:

**소개**

  - [타이타닉 데이터셋](https://www.kaggle.com/c/titanic) 전처리를 진행 합니다.
  - [파이썬 데이터전처리 실습-Titanic](https://wikidocs.net/86297)를 참고하여 전처리를 진행 합니다.
  - 향후 이 코드를 이어서 사용하니 코드를 잘 정리해 주세요.

## 데이터 전처리
---

In [ ]:
import numpy as np
import pandas as pd

#### 00. 데이터 불러오기

In [ ]:
train = pd.read_csv('/content/train.csv')
# .read_csv('경로') 함수를 통해 데이터를 불러온다.

#### 01. 결측치 확인

In [ ]:
print(train.info()) 
# .info()함수로 데이터에 대한 개략적 정보 표시. 
# non-null의 개수가 다른것을 보아 몇몇 column에 결측치가 있음을 알 수 있다. 

print(train.isnull().sum()) 
# 각 컬럼별 정확한 null의 개수를 구한다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### 02. 데이터 맛보기

In [ ]:
train.head() 
# head()함수로 header와 다섯번재 row까지 불러온다. 
# column의 종류와 column별 values가 어떤 모습인지에 대해 간단히 볼수있다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 03. 데이터 타입 확인하기

In [ ]:
train.dtypes 
# .dtypes 함수로 각 컬럼의 데이터 타입을 확인한다.

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

 #### 04. 각 column별 기술 통계량

In [ ]:
train.describe()
# .describe()를 통해 각 column별 기술 통계량을 확인한다.
# dtype이 object인 column은 제외된다.

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### 05. dtype이 object인 Column의 단일값 확인

In [ ]:
# dtype이 object인 경우 기술통계량을 보지 못했기에 .unique()함수로 단일값을 확인해본다. 

# Name의 경우 예상가능하고 다 다를 것이기 때문에 제외한다.  
# (train['Ticket'].unique())의 경우도  별로 유용해보이지 않는다. 

print(train['Sex'].unique())
# male과 female 두가지의 범주가 있다. 

print(train['Cabin'].unique())
# Cabin number의 경우 하나의 알파벳과 두자리의 숫자로 구성되어 있다.  

print(train['Embarked'].unique())
# 총 세가지의 탑승 위치가 있다. 
# C = Cherbourg, Q = Queenstown, S = Southampton

['male' 'female']
[nan 'C85' 'C123' 'E46' 'G6' 'C103' 'D56' 'A6' 'C23 C25 C27' 'B78' 'D33'
 'B30' 'C52' 'B28' 'C83' 'F33' 'F G73' 'E31' 'A5' 'D10 D12' 'D26' 'C110'
 'B58 B60' 'E101' 'F E69' 'D47' 'B86' 'F2' 'C2' 'E33' 'B19' 'A7' 'C49'
 'F4' 'A32' 'B4' 'B80' 'A31' 'D36' 'D15' 'C93' 'C78' 'D35' 'C87' 'B77'
 'E67' 'B94' 'C125' 'C99' 'C118' 'D7' 'A19' 'B49' 'D' 'C22 C26' 'C106'
 'C65' 'E36' 'C54' 'B57 B59 B63 B66' 'C7' 'E34' 'C32' 'B18' 'C124' 'C91'
 'E40' 'T' 'C128' 'D37' 'B35' 'E50' 'C82' 'B96 B98' 'E10' 'E44' 'A34'
 'C104' 'C111' 'C92' 'E38' 'D21' 'E12' 'E63' 'A14' 'B37' 'C30' 'D20' 'B79'
 'E25' 'D46' 'B73' 'C95' 'B38' 'B39' 'B22' 'C86' 'C70' 'A16' 'C101' 'C68'
 'A10' 'E68' 'B41' 'A20' 'D19' 'D50' 'D9' 'A23' 'B50' 'A26' 'D48' 'E58'
 'C126' 'B71' 'B51 B53 B55' 'D49' 'B5' 'B20' 'F G63' 'C62 C64' 'E24' 'C90'
 'C45' 'E8' 'B101' 'D45' 'C46' 'D30' 'E121' 'D11' 'E77' 'F38' 'B3' 'D6'
 'B82 B84' 'D17' 'A36' 'B102' 'B69' 'E49' 'C47' 'D28' 'E17' 'A24' 'C50'
 'B42' 'C148']
['S' 'C' 'Q' nan]

#### 06. 생존한 사람, 사망한 사람의 수 확인하기

In [ ]:
# .value_counts() 함수를 통하여 'Survived' column의 value별 개수를 알 수 있다. 
# .value_counts()의 결과 type이 <class 'pandas.core.series.Series'> 이며, 
# 생존 여부는 
# index가  0인 경우 No, index가 1인 경우 Yes 이기에 indexing을 통하여 각각의 수를 구할 수 있다.
 
n_deceased = train['Survived'].value_counts()[0]
n_survived = train['Survived'].value_counts()[1]

print(f'사망한 사람: {n_deceased}명')
print(f'생존한 사람: {n_survived}명')

사망한 사람: 549명
생존한 사람: 342명

#### 07. 각 클래스('Pclass')별 탑승객 분포 확인하기

In [ ]:
train['Pclass'].value_counts()
# .value_counts() 함수를 통하여 해당하는 column의 value별 개수를 확인할 수 있다. 

# 3등석 승객이 491명으로 가장 많고
# 1등석 승객이 216명으로 그 다음으로 많으며
# 2등석 승객이 184명으로 가장 적다.

3    491
1    216
2    184
Name: Pclass, dtype: int64

#### 08. 성('Sex')별 탑승객 분표 확인하기

In [ ]:
train['Sex'].value_counts()
# .value_counts() 함수를 통하여 해당하는 column의 value별 개수를 확인할 수 있다. 

# male이 577명 female이 314명으로 남자의 수가 훨씬 더 많다.

male      577
female    314
Name: Sex, dtype: int64

#### 09. 탑승 위치('Embarked') 별 탑승객 분표 확인하기

In [ ]:
train['Embarked'].value_counts()
# .value_counts() 함수를 통하여 해당하는 column의 value별 개수를 확인할 수 있다. 
# C = Cherbourg, Q = Queenstown, S = Southampton
# Southampton 에서 644명으로 가장 많이 탑승했고 , Cherbourg에서 168명, Queenstown에서 가장 적은 수인 77명이 탑승했다.

S    644
C    168
Q     77
Name: Embarked, dtype: int64

#### 10. 'Embarked' 필드의 결측치 처리

In [ ]:
train['Embarked'] = train['Embarked'].fillna('S')

# 'Embarked' 필드의 결측치의경우 .fillna()함수를 사용해서 위에서 값이 가장 많았던 'S'로 할당하여 처리한다.

####11. 'Age' 필드의 결측치 처리

In [ ]:
# 'Age' 필드의 결측치는 'Age' column의 중간값으로 할당하려고 한다.

train.median() 
# .median()함수를 통하여 각 컬럼별 중간값을 알 수 있다.

median_age = train['Age'].median()
# 'Age'로 인덱싱을하고 .median()함수를 써서 'Age'필드의 중간값을 구한다음 median_age에 바인딩 해준다. 
median_age

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  This is separate from the ipykernel package so we can avoid doing imports until

28.0

In [ ]:
train['Age'] = train['Age'].fillna(median_age)

# 이제 'Age'필드의 결측치를 .fillna()함수를 사용해서 median_age 로 할당하여 처리한다.

#### 12. 결측치 중간 확인

In [ ]:
train.isnull().sum() 
# .isnull().sum() 함수를 통하여 각 컬럼별 결측치의 총 계수를 다시한번 확인한다. 

# 이제 Cabin을 제외하고는 결측치가 없어졌다. 
# 위에서 결측치가 잘 처리되었음을 알수 있다.

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

#### 13. 'Name'필드에서 신분을 나타내는 단어를 뽑아서 'Title' 필드에 할당하기

In [ ]:
train['Title'] = train['Name'].str.extract('([A-Za-z]+)\.', expand=False)

# .str.extract('정규표현식') 함수를 통해서 'Name'필드의 values에서 
# '([A-Za-z]+)\.'에 해당하는 문자열만 추출해낸다. 
# 위의 표현식의 경우 
# 대문자 A와 Z 사이 알파벳으로 시작하면서 소문자 a와z 사이 알파벳이 최소 한 번 이상 반복되어야(+)하고 , 
# 마침표(.)로 끝나는 문자열을 의미한다. 
# expand = False 를 통하여 label단위로 출력한다.
train['Title']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: Title, Length: 891, dtype: object

#### 14. 'Title' 필드의 카테고리를 6개의 항목으로 변경하기

In [ ]:
# 일단 .uniqie() 함수를 통하여 train['Title]의 고유값을 확인해본다. 
train['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'Countess',
       'Jonkheer'], dtype=object)

In [ ]:
train['Title'] = train['Title'].replace(['Capt', 'Col', 'Major', 'Dr', 'Rev'], 'Officer')
train['Title'] = train['Title'].replace(['Jonkheer', 'Master'], 'Master')
train['Title'] = train['Title'].replace(['Don', 'Sir', 'the Countess', 'Lady', 'Dona'], 'Royalty')
train['Title'] = train['Title'].replace(['Mme', 'Ms', 'Mrs'], 'Mrs')
train['Title'] = train['Title'].replace(['Mlle', 'Miss'], 'Miss')
train['Title'] = train['Title'].replace(['Mr'], 'Mr')

# replace() 함수를 통해서 기존의 title을 나타내었던 문자열을 
# Officer, Master, Royalty, Mrs, Miss, Mr 중 해당하는 카테고리의 문자열로 치환한다.

#### 16. 변수 y를 선언해서 학습할 목표변수(=종속변수)인 'Survived'필드값을 담기

In [ ]:
y = train['Survived'] 
# 새로운 변수 y에  'Survived' 컬럼의 값을 바인딩 한다

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

#### 17. 나이('Age') 필드를 그룹핑하여 'AgeGroup'필드 생성하여 할당하기

In [ ]:
train['Age'].describe()
# .describe() 함수를 통해서 대략적인 Age 분포를 확인한다.

count    891.000000
mean      29.361582
std       13.019697
min        0.420000
25%       22.000000
50%       28.000000
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [ ]:
bins = [0,10,20,35,60,100]
# 구간 리스트를 만든다. 

names = ['YoungChild', 'Teens', 'YoungAdult', 'Adult', 'Senior']
# 구간의 명칭을 담은 리스트를 만든다. 

train['AgeGroup'] = pd.cut(train['Age'], bins = bins, labels = names)
# pd.cut(column, bins, labels) 함수를 통하여 해당하는 컬럼의 
# bins 범위의 숫자를 names 범주로 나누어준다.

In [ ]:
# .value_counts()로 잘 나눠졌는지 확인해본다. 
train['AgeGroup'].value_counts()

YoungAdult    318
Adult         195
Teens         115
YoungChild     64
Senior         22
Name: AgeGroup, dtype: int64